import { ArrowRightLeft, CheckSquare, MessageSquare } from 'lucide-react'

export const QUESTION_TYPES = [
	{
		id: 'choice',
		icon: <CheckSquare size={48} />,
		label: 'Выбор ответа',
		description:
			'Тестовый вопрос с выбором одного или нескольких правильных вариантов',
		apiType: 'choice',
		instruction: {
			title: 'Как создать вопрос с выбором ответа',
			description:
				'Поддерживает как один, так и несколько верных вариантов ответа.',
			steps: [
				'Заголовок: чётко сформулируйте задание;',
				'Варианты ответов: внесите искомый вариант ответа и дистракторы;',
				'Выбор правильного варианта ответа: отметьте галочкой один или несколько пунктов;',
				'Между вариантами ответа по завершению задания знаки препинания не ставятся. Воздержитесь от точек с запятой между вариантами ответов;',
				'В вариантах ответа не допускается использование нумерации, введённой вручную в текстовое поле, в связи с автоматическим перемешиванием вопросов.',
			],
		},
	},
	{
		id: 'open',
		icon: <MessageSquare size={48} />,
		label: 'Открытый ответ',
		description:
			'Вопрос, предполагающий развернутый текстовый ответ в свободной форме',
		apiType: 'open',
		instruction: {
			title: 'Как создать открытый вопрос',
			description:
				'Обратите внимание: это единственный тип вопроса, который требует ручной проверки преподавателем (автоматическая оценка не производится).',
			steps: ['Заголовок: чётко сформулируйте задание или вопрос;'],
		},
	},
	{
		id: 'matching',
		icon: <ArrowRightLeft size={48} />,
		label: 'Сопоставление',
		description:
			'Задание на установление соответствия между элементами двух списков',
		apiType: 'matching',
		instruction: {
			title: 'Как создать вопрос на сопоставление',
			description:
				'Система автоматически перемешает элементы правого столбца для студентов.',
			steps: [
				'Заголовок: чётко сформулируйте задание;',
				'Пары соответствия: в левом столбце укажите понятия, в правом — соответствующие им определения;',
				'Создание пары: нажмите сначала на левый элемент, затем на правый — выбранная пара подсветится;',
				'Между вариантами ответа знаки препинания не ставятся;',
				'В вариантах ответа не допускается использование нумерации, введённой вручную в текстовое поле.',
			],
		},
	},
]
